[
	"How did the hipster burn his mouth?\nHe sipped his coffee before it was cool!",
	"Where does the king keep his armies?\nUp his sleevies",
	"Did you hear about the guy who invented the knock knock joke?\nHe won the 'no-bell' prize!",
	"My dog used to chase people on a bike. It got so bad, I had to take his bike away!",
	"What do you call a sketchy neighborhood in Italy?\nA Spaghetto!",
	"The Past, The Present and The Future walked into a bar.\nIt was tense.",
	"What do you get when you combine a rhetorical question and a joke?",
	"Where do cows go for a first date?\nTo the moooovies!",
	"What is a wok?\nA wok is sumting you twow at wabbits.",
	"What do you call Batman when he skips church?\nChristian Bale!",
	"What do you call someone else's cheese?\nNacho Cheese!",
	"A man walks into a bar holding a piece of asphalt.\nThe man says, 'A beer please, and one for the road!'",
	"I sold my vacuum the other day...\nall it was doing was collecting dust!",
	"Why couldn't the bicycle stand up by itself?\nIt was two tired!",
	"Why can't a nose be 12 inches long?\nBecause then it'll be a foot!",
	"What does a clock do when it's hungry?\nIt goes back four seconds!",
	"Who's the king of the classroom?\nThe Ruler!",
	"Why do birds fly south for the winter?\nBecause it's too far to walk!",
	"When does a joke become a dad joke?\nWhen it becomes apparent!",
	"What did the green grape say to the purple grape?\nBreathe dammit, BREATHE!",
	"What's Forrest Gump's email password?\n1forrest1",
	"My girlfriend says she needs time and distance...\nIs she calculating velocity?",
	"Why should you not write with a dull pencil?\nBecause it's pointless.",
	"What did the janitor say when he jumped out of the closet?\nSupplies!",
	"Why did the picture go to jail?\nBecause he was framed!",
	"What did the fish say when it swam into the wall?\nDam.",
	"A mexican magician tells the audience he will disappear on the count of 3. He says, 'Uno, dos...' and then *poof*... he disappeared without a tres!",
	"I think I want a job cleaning mirrors.\nIt's something I could really see myself doing.",
	"Two satellites decided to get married.\nThe wedding wasn't much, but the reception was incredible!",
	"What do you call a belt made out of watches?\nA waist of time!",
	"What's the best thing about Switzerland?\nI don't know, but their flag is a huge plus.",
	"My grandad has the heart of a lion\nand a lifetime ban from the zoo.",
	"Does anyone need an ark?\nI Noah guy.",
	"Why did Cinderella get kicked off the soccer team?\nBecause she kept running from the ball!",
	"What do we want?\nLOW FLYING AIRPLANE NOISES!\nWhen do we want them?\nNNNEEEEEEEOOOOOOOWWWWWwwwwwwww...",
	"Why do ghosts love elevators?\nBecause they lift their spirits!",
	"I'm really starting to hate these stupid little Russian Dolls.\nThey're so full of themselves.",
	"Why can't zoo animals take tests?\nThere are too many cheetahs!",
	"What do you call a snobbish prisoner going down the stairs?\nA condescending con descending.",
	"What do you call an alligator that wears a vest?\nAn investigator.",
	"Why is Peter Pan always flying?\nHe neverlands!",
	"Who is bigger: Mr. Bigger or Mr. Bigger's baby?\nThe baby, because he's a little bigger.",
	"What does a baby computer call his father?\nData!",
	"Why did the cyclops close his school?\nBecause he only had one pupil!",
	"A pair of jumper cables walks into a bar.\nThe bartender says, 'I'll serve you, but don't start anything!'",
	"Who invented the round table?\nSir Cumference!",
	"What did the mother Buffalo say when her boy left for college?\nBison!",
	"Why are ghosts banned from the liquor store?\nBecause they would steal all the boos!",
	"Why don't oysters give to charity?\nBecause they are shellfish!",
	"What did the pirate say when he turned 80?\nEye-matey!",
	"What do you call somebody with no body and just a nose?\nNobody knows!",
	"What did one ocean say to the other ocean?\nNothing, they just waved.",
	"What's the best way to carve wood?\nWhittle by whittle.",
	"What type of music do mummies listen to?\nWrap music!",
	"Why didn't the terminator upgrade to windows 10?\nI asked him and he said, 'I still love vista, baby!'",
	"What's the difference between a zippo and a hippo?\nOne's really heavy, and the other's a little lighter!",
	"What didn't the melons get married?\nBecause they cantaloupe!",
	"I used to have a job at a calendar factory but I got fired because I took a couple of days off.",
	"Did you hear about the circus fire?\nIt was in tents!",
	"How many bugs do you need to rent out an apartment?\nTenants.",
	"How do you organize a space-themed party?\nYou planet.",
	"What do you call a factory that sells passable products?\nA satisfactory!",
	"I'm only familiar with 25 letters in the English language.\nI don't know why!",
	"What's the difference between a tennis ball and the prince of Wales?\nOne is heir to the throne and the other is thrown into the air.",
	"What do you get from a pampered cow?\nSpoiled milk!",
	"Why did the coffee file a police report?\nIt got mugged.",
	"How does an Eskimo build his house?\nIgloos it together.",
	"I saw this advert in a window that said: 'Television for sale, $1, volume stuck on full.'\nI thought, 'I can't turn that down.'",
	"The shovel was a ground-breaking invention.",
	"Two guys walk into a bar.\nThe third guy ducks.",
	"What's green and has wheels?\nGrass. I lied about the wheels.",
	"Which country's capital has the fastest-growing population?\nIreland. Every day it's Dublin.",
	"How do you call someone who hasn't tried VR?\nA VRgin.",
	"What do you call a thieving alligator?\nA crookodile.",
	"What do you call a bee that can't make up its mind?\nMaybe."
]